<script setup lang="ts">
const isDark = useDark();
</script>

<template>
  <div class="flex gap-5">
    <AboutCoursesCardItem
      :img="`~/assets/img/AboutCourses/${isDark ? 'DarkCard1.svg' : 'LightCard1.svg'}`"
    >
      <template v-slot:title>
        Курсы от лучших авторов — всё в одном месте
      </template>
      <template v-slot:text>
        Учись у тех, кто делает результат, а не просто рассказывает о нём Мы
        собрали для тебя сильные образовательные программы от проверенных
        экспертов — практиков, которые знают, как применить знания в реальной
        работе. Ты найдёшь курсы по аналитике, дизайну, маркетингу,
        программированию и другим востребованным направлениям. Все курсы
        проходят модерацию, чтобы ты получал только качественный и актуальный
        контент. Хочешь прокачать конкретный навык или сменить профессию с нуля?
        Мы поможем подобрать подходящий курс. Учиться можно в удобное время, в
        удобном темпе — на твоих условиях.
      </template>
    </AboutCoursesCardItem>
  </div>
</template>

<style scoped lang="scss"></style>
